# LAB | Connecting Python to SQL

### Challenge
In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:

1. Establish a connection between Python and the Sakila database.

In [3]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass("Please enter your MySQL password:")

Please enter your MySQL password: ········

In [6]:
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [15]:
from sqlalchemy import text

with engine.connect() as connection:
    query = text('SELECT * FROM film') # testing the conection
    result = connection.execute(query) 
    
result

2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:
    - engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
    - month: an integer representing the month for which rental data is to be retrieved.
    - year: an integer representing the year for which rental data is to be retrieved.

In [36]:
def rentals_month(engine, month, year):    
    # SQL query to retrieve data for the specified month and year
    query = """
    SELECT 
        rental_id,
        rental_date,
        inventory_id,
        customer_id,
        return_date,
        staff_id,
        last_update
    FROM 
        rental
    WHERE 
        MONTH(rental_date) = %s AND YEAR(rental_date) = %s;
    """
    # Execute the query and return the results as a DataFrame
    # read_sql() is the most straightforward approach because it directly returns a DataFrame
    return pd.read_sql(query, engine, params=(month, year))

# rental data for a may_2005
df_rentals_may_2005 = rentals_month(engine, 5, 2005)

# Display first rows 
display(df_rentals_may_2005.head())

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

3. Develop a Python function called 'rental_count_month' that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each 'customer_id' during the selected month and year.

   The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

   Hint: Consider making use of pandas groupby()

In [55]:
def rental_count_month(df, month, year):
    # Group by customer_id and count the number of rentals
    rental_counts = df.groupby('customer_id')['rental_id'].count().reset_index()
    
    # Create the new column name based on the provided month and year
    column_name = f"rentals_{str(month)}_{year}"
    
    # Rename the count column to the new column name
    rental_counts = rental_counts.rename(columns={'rental_id': column_name})
    
    return rental_counts


# Example: assuming df_rentals_may_2005 is the DataFrame returned by rentals_month(engine, 5, 2005)
rental_counts_may_2005 = rental_count_month(df_rentals_may_2005, 5, 2005)

# Display results 
display(rental_counts_may_2005)

     customer_id  rentals_5_2005
0              1               2
1              2               1
2              3               2
3              5               3
4              6               3
..           ...             ...
515          594               4
516          595               1
517          596               6
518          597               2
519          599               1

[520 rows x 2 columns]

4. Create a Python function 'called compare_rentals' that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [61]:
def compare_rentals(df1, df2, month1, year1, month2, year2):
    # Create column names for the rental counts
    column_name1 = "rentals_" + str(month1) + "_" + str(year1)
    column_name2 = "rentals_" + str(month2) + "_" + str(year2)
    
    # Merge the two DataFrames on customer_id
    combined_df = pd.merge(df1, df2, on='customer_id', how='outer', suffixes=('_1', '_2'))
    
    # Rename the columns to reflect the month and year
    combined_df = combined_df.rename(columns={
        'rentals_1': column_name1,
        'rentals_2': column_name2
    })
    # Calculate the difference between the two months
    combined_df['difference'] = combined_df[column_name2] - combined_df[column_name1]
    
    return combined_df

# Example: assuming rental_counts_may_2005 and rental_counts_june_2005 are the DataFrames
df_may_2005 = pd.DataFrame({'customer_id': [1, 2, 3], 'rentals': [3, 1, 2]})
df_june_2005 = pd.DataFrame({'customer_id': [1, 2, 4], 'rentals': [4, 2, 1]})

combined_df = compare_rentals(df_may_2005, df_june_2005, 5, 2005, 6, 2005)

# Display the resulting DataFrame
display(combined_df)

   customer_id  rentals_5_2005  rentals_6_2005  difference
0            1             3.0             4.0         1.0
1            2             1.0             2.0         1.0
2            3             2.0             NaN         NaN
3            4             NaN             1.0         NaN